# 데이터 관리 프로그램 만들기

In [1]:
class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)

print('슝=3')
#텍스트 파일에서 불러온 각각의 데이터는 string으로 처리되므로 형 변환을 해야함.

슝=3

In [2]:
employee1 = Employee('Ahn TaeHee', 'AI Team', '3', '3', '300')

In [3]:
#파일을 한줄씩 읽은 후 데이터 값을 사용해 자동으로 인스턴스 객체를 만드는 함수.
def make_employee(inputdata):
    name, division, jopgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jopgrade, year, basic)
print('슝=3')

슝=3

In [4]:
import os
file_path = os.getenv("HOME") + '/aiffel/data_handling/data/employeefile.txt'
print(file_path)
inputfile = open(file_path, 'r')

for i in inputfile:
    e = make_employee(i)

/aiffel/aiffel/data_handling/data/employeefile.txt

## 정보 접근자 메소드

In [5]:
class Employee:
    def get_name(self):
        return self.name
    def get_division(self):
        return self.division
    def get_jobgrade(self):
        return self.jobgrade
    def get_years(self):
        return self.years
    def get_basic(self):
        return self.basic

print('슝=3')

슝=3

In [6]:
#급여 계산 함수
def get_salary(self):
    self.salary = self.basic + (self.basic * self.years * 0.1)
    return self.salary

## 최종 Employee 클래스

In [7]:
#salary에 초기값 0 설정
class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0

    def get_name(self):
        return self.name

    def get_divison(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic

    def get_salary(self):
        self.salary = self.basic + (self.basic * self.years * 0.1)
        return self.salary

print('슝=3')

슝=3

## 최종 코드

In [8]:
#파일 열고 각 사원의 월급 비교 후 가장 높은 월급 가진 사원의 정보 출력

import os

class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0

    def get_name(self):
        return self.name

    def get_division(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic

    def get_salary(self):
        self.salary = self.basic + (self.basic * self.years * 0.1)
        return self.salary

def make_employee(inputdata):
    name, division, jopgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jopgrade, year, basic)

def summarize():
    file_path = os.getenv("HOME") + '/aiffel/data_handling/data/employeefile.txt'
    inputfile = open(file_path, 'r')
    highest = make_employee(inputfile.readline())
    for l in inputfile:
        e = make_employee(l)
        if e.get_salary() > highest.get_salary():
            highest = e
    inputfile.close()
    
    print("The name of the highest salary employee is: ", highest.get_name())
    print("Years of service: ", highest.get_years())
    print("Division: ", highest.get_division())
    print("Salay: ", highest.get_salary())

print('슝=3')

슝=3

In [9]:
summarize()

The name of the highest salary employee is:  Kim YoungJae
Years of service:  7
Division:   Sales
Salay:  1020.0

## 데이터 병합

In [10]:
import pandas as pd

df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Math': [100, 55, 38, 43, 68, 82]})

print(df1)
print('---')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
---
       Student  Math
0    KimTaemin   100
1     HaJaehwa    55
2  JungSayoung    38
3     Sonjimin    43
4    Leesoomin    68
5      KangJun    82

In [11]:
pd.merge(df1, df2)

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [12]:
pd.merge(df1, df2, on='Student')

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [13]:
#공통 데이터에 대해서 병합

pd.merge(df1, df2, how='inner')

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [14]:
pd.merge(df1, df2)

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [15]:
#전체 데이터에 병합
pd.merge(df1, df2, how='outer')

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [16]:
#merge랑 같은
df1.join(df2, how='outer', lsuffix='_caller', rsuffix='_other')   # '_caller'인 df1 컬럼이 왼쪽에 가도록 배치

  Student_caller  Korean  English Student_other  Math
0      KimTaemin      90       80     KimTaemin   100
1       HaJaehwa      85       90      HaJaehwa    55
2    JungSayoung      88       40   JungSayoung    38
3       Sonjimin      35       44      Sonjimin    43
4      Leesoomin      40       55     Leesoomin    68
5        KangJun      44       90       KangJun    82

In [18]:
#데이터 칼럼을 늘리는 것이 아닌, 데이터의 행을 합침
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','LeeJae','KimJaehee'],
                    'Korean': [44,73,100]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Korean
0  Jiyoungmin      44
1      LeeJae      73
2   KimJaehee     100

In [20]:
pd.concat([df1,df2], sort=False)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
0   Jiyoungmin      44      NaN
1       LeeJae      73      NaN
2    KimJaehee     100      NaN

In [21]:
pd.concat([df1, df2], sort=False, ignore_index=True)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
6   Jiyoungmin      44      NaN
7       LeeJae      73      NaN
8    KimJaehee     100      NaN

## 필터링 연산

In [22]:
df = pd.DataFrame({"A": [1,4,7], "B": [2,5,8], "C":[3,6,9]})

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
#칼럼명 형식 사용
df['A']

0    1
1    4
2    7
Name: A, dtype: int64

In [24]:
#loc()사용
print(df.loc[0])

A    1
B    2
C    3
Name: 0, dtype: int64

In [25]:
print(df.loc[0, 'B'])

2

In [26]:
print(df.iloc[0])

A    1
B    2
C    3
Name: 0, dtype: int64

In [27]:
print(df.iloc[0, 1])

2

- iloc()에 칼럼 이름 주면 에러 남!

## 그룹 연산
- groupby()객체를 생성
- groupby()객체의 연산을 수행
  - max(), min(), sum(), mean()
  - apply() 메소드를 통해 특수 수식에 대한 연산을 수행할 수 있음.

In [28]:
df = pd.DataFrame({'Columns1':['A','A','B','B','C','C','A','B'],
                   'Columns2':[10, 2, 30, -6, 8, 9, 5, 2]})

df

  Columns1  Columns2
0        A        10
1        A         2
2        B        30
3        B        -6
4        C         8
5        C         9
6        A         5
7        B         2

In [29]:
import numpy as  np
df.groupby(['Columns1']).max().apply(np.sqrt)

          Columns2
Columns1
A         3.162278
B         5.477226
C         3.000000

# pandas transform 연습

In [30]:
#데이터 로드
import pandas as pd
import numpy as np

file_path = os.getenv("HOME") + '/aiffel/data_handling/data/Salaries.csv'
sal = pd.read_csv(file_path)

sal.head(5)

/opt/conda/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3146: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [31]:
sal['BasePay'].mean()

66327.68895967308

In [32]:
sal['OvertimePay'].max()

245131.88

In [33]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [34]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [35]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [36]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
110530,110531,David P Kucia,Police Officer 3,NaN,0.0,0.0,-33.89,0.0,-33.89,2013,NaN,San Francisco,NaN

In [37]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66573.154204
Name: BasePay, dtype: float64

In [38]:
sal['JobTitle'].nunique()

2158

In [39]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [40]:
def chief_string(title):
    if 'chief' in title.lower().split(): 
        return True
    else:
        return False
sum(sal['JobTitle'].apply(lambda x : chief_string(x)))

477

# 데이터베이스

## 다중 사용자 환경

In [41]:
C_account = 100      # 현재 C 고객 계좌 잔고는 100

C_account_by_A_process = 100    # A 고객 응대 프로그램이 C 고객 계좌 잔고를 조회했습니다 
C_account_by_B_process = 100    # B 고객 응대 프로그램이 C 고객 계좌 잔고를 조회했습니다 

C_account_by_A_process = C_account_by_A_process + 50   # A 고객이 50을 입금했습니다. 
C_account_by_B_process = C_account_by_B_process + 30   # A 고객이 30을 입금했습니다. 

C_account = C_account_by_A_process     # A 고객의 입금이 C 고객 계좌 잔고에 반영되었습니다. 
C_account = C_account_by_B_process     # B 고객의 입금이 C 고객 계좌 잔고에 반영되었습니다. 

print(C_account)     # C 고객 계좌 잔고는 얼마일까요?

130

-  우리는 다수 사용자에 대응할 수 있는 실시간 트랜잭션 처리 기능을 갖춘, 데이터의 정합성을 보장하는 훌륭한 데이터 관리 프로세스를 필요로 하게 됨.
- 그래서 필요한 것이 바로 데이터베이스 관리 시스템(DBMS).

-  데이터만을 저장하는 공간을 하나 만드는데 흔히 물리적 컴퓨터에 방점을 두어 데이터 서버 컴퓨터, 또는 추상적인 정보의 집합에 방점을 두어 데이터베이스라고 함.
- 데이터만을 위한 데이터 서버 컴퓨터가 있고, 해당 서버에 접근하는 전용 프로그램을 이용해서 데이터를 읽고 수정하는 것.
- 데이터를 요청하는 "쿼리(query)"를 작성하기 위한 언어 중 하나가 SQL(Structured Query Language).
- SQL은 영어에서 볼 수 있듯이 구조적 질의어(=데이터 서버에게 원하는 정보를 일목요연하게 말해주는 것)를 뜻하며, 일종의 프로그래밍 언어로 발전되어 옴.

-  DBA(Database Architect)는 데이터를 어떻게 관리할지, 어떤 항목으로 관리할지 등을 설계하고 데이터베이스에 접근하기 위한 쿼리를 작성하는데 이때 설계하는 데이터베이스의 구조를 전문 용어로 스키마(schema)라고 함.

### 관계형 데이터베이스
- 가장 오랜 시간 많이 쓰이고 있는 데이터베이스.
-  데이터를 "표" 형태로 표현하고 어떤 관계(연관)가 있는 항목끼리 묶어서 관리하는 체계.

## SQL
-  한가지 프로토콜만 알고 있다면 어떤 데이터베이스이든 접속해서 기본적인 데이터 정의와 조작이 가능한데 그것이 SQL임.
- QL은 API나 프로토콜과 비슷하게 데이터베이스에 접근하는 하나의 "인터페이스" 역할을 하지만 API나 프로토콜과는 사용법이 다름.
- SQL은 어떤 결과를 얻기 위해 수행 과정을 나열하는 것이 아닌 원하는 결과를 질의하는 언어의 형태를 띠고 있음.
- 데이터베이스 또한 SQL이라는 표준 인터페이스를 누구나 제공할 수 있었기 때문에 대중화가 가능했던 것.

- 클라이언트는 데이터베이스에 접근하는 하나의 프로그램, 예를 들어 내가 사용하는 컴퓨터의 CLI 등을 의미.
- SQL 질의(Query)는 클라이언트(client)에서 데이터베이스 서버로 전송하는 텍스트 문자열임.
- 직접 데이터베이스 컴퓨터에 접속해서 데이터를 꺼내올 수 없기 때문에, 클라이언트 프로그램을 사용해 서버에 정돈된 질의를 날리면 서버가 그 값을 받아 결괏값을 보내줌.

### SQL문 종류
- DDL(Data Definition Language, 데이터 정의어)
  - 테이블이나 관계의 구조를 생성하는 데 사용.
  - 테이블, 데이터베이스, 사용자에 대한 생성, 삭제 제약조건(constraint), 권한(permission)을 설정.
- DML (Data Manipulation Language, 데이터 조작어)
  - 테이블의 데이터를 조회, 삽입, 갱신, 삭제할 때 사용.
  - 이런 데이터의 기본 조작 행위를 CRUD라고 함.
  - 생성(Create): INSERT 문 사용
  - 조회(Read): SELECT 문 사용
  - 갱신(Update): UPDATE 문 사용
  - 삭제(Delete): DELETE 문 사용

# 파이썬 DB 다루기
- 파이썬 인터프리터는 데이터베이스를 바로 사용할 수 있도록 표준 API를 지원함.
- 데이터베이스 전용 드라이버만 설치하면 되고, SQLite는 이미 내장되어 있어서 별도의 설치가 필요 없음.

## AIP 메인 함수
- connect(): 데이터베이스의 연결을 만듦.
- cursor(): 질의를 관리하기 위한 커서 객체 생성. file의 open과 비슷)
- execute(), excutemany(): 데이터베이스에 하나 이상의 SQL명령을 실행.
- fetchone(), fetchmany(), fetchall(): 실행 결과를 얻음.

### 연결: connect()

In [43]:
import sqlite3
conn = sqlite3.connect('example.db')

In [45]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 822 kB/s  eta 0:00:01
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2
WARNING: You are using pip version 20.3.3; however, version 21.2.4 is available.
You should consider upgrading via the '/opt/conda/bin/python3.7 -m pip install --upgrade pip' command.

In [47]:
import pymysql
pymysql.install_as_MySQLdb()

In [48]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', port=3308, db='example.db', user='root',
passwd='1234')

OperationalError: (2003, "Can't connect to MySQL server on 'localhost' ([Errno 99] Cannot assign requested address)")

- MySQL 공식 드라이버를 설치한 후 MySQL서버에 원격으로 접속한다면 위가 진행될 것. 
- 커넥션 객체 conn을 얻는 과정에서 로그인에 필요한 서버와 포트번호, ID/password 등의 부가적인 정보를 필요로 함.

In [49]:
#커서 객체 만들기
c = conn.cursor()

In [50]:
##쿼리 명령어

# Create table
c.execute('''CREATE TABLE stocks
             (date text, trans text, symbol text, qty real, price real)''')

# Insert a row of data
c.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)")

In [51]:
#데이터베이스에 반영
conn.commit()

In [52]:
#종료
conn.close()

# 실제 데이터베이스 구현

In [53]:
import sqlite3

conn = sqlite3.connect(':memory:')
query = """CREATE TABLE sales
            (product VARCHAR(20),
            maker VARCHAR(40),
            amount FLOAT,
            date DATE);"""
conn.execute(query)
conn.commit()

data = [('smart phone', 'Apple', '47.2', '2019-08-03'),
        ('printer', 'Samsung', '15.2', '2018-02-10',),
        ('monitor', 'LG', '14.25', '2019-12-20'),
        ('python book', 'Amazon', '12.40', '2020-01-23')]
statement = "INSERT INTO sales VALUES(?, ?, ?, ?)"
conn.executemany(statement, data)
conn.commit()

cursor = conn.execute("SELECT * FROM sales")
rows = cursor.fetchall()

row_counter = 0
for row in rows:
    print(row)
    row_counter +=1

print("Number of rows: {}".format(row_counter))

('smart phone', 'Apple', 47.2, '2019-08-03')
('printer', 'Samsung', 15.2, '2018-02-10')
('monitor', 'LG', 14.25, '2019-12-20')
('python book', 'Amazon', 12.4, '2020-01-23')
Number of rows: 4